#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+TITLE: ch2Notes
#+AUTHOR: Britt Anderson
#+EMAIL: britt@uwaterloo.ca
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: 
#+CREATOR: Emacs 25.1.1 (Org mode 9.0.3)
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER:
#+LATEX_HEADER_EXTRA:
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE:
#+LATEX_COMPILER: pdflatex
#+DATE: \today

** Explorations 
   :Properties:
   :CUSTOM_ID: explorations
   :End:

   1. Explorations can often start by drawing or sketching. Never underestimate the utility of trying to graph or visualize the problem.
   2. Open up [[file:ch2Explore.ods][spreadsheet]]
   3. Insert a formula for error of square root of 128
      
      How to specify a formula

      ~$~ freezes column and row references.

      How you get more flexibility by using references (variables) rather than ~hard coding~.

   4. Class activity. Make a spreadsheet that finds the cube root of any number.

   5. Same thing in Python


   #+BEGIN_SRC python :session *newton* :results value :exports both

     guesses = [5.0]
     errors = [10000]

     def cube (x):
         return x**3

     def derivCube (x):
         return 3*x**2

     tolerance = 0.01

     while (errors[-1] > tolerance):
         errors.append(128 - cube(guesses[-1]))
         guesses.append(errors[-1]/derivCube(guesses[-1]) + guesses[-1])

     (errors,guesses)

   #+END_SRC

   #+RESULTS:
   | 10000 |  3.0 | -0.024064000000009855 |
   |   5.0 | 5.04 |     5.039684219366759 |

